driver-tests/iepse/IEPContiguousOrder/ContiguousOrderApp/test/DeleteStreamInput/template.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tim="DeleteStreamInput.DeleteStreamInput_iep">
   <soapenv:Header/>
   <soapenv:Body>
      <tim:StreamInput0_MsgObj>
         <a>${a.0}</a>
         <b>${b.0}</b>
         <d>${d.0}</d>        
      </tim:StreamInput0_MsgObj>
   </soapenv:Body>
</soapenv:Envelope>